<template><h1 id="mysql-遇到的死锁问题" tabindex="-1"><a class="header-anchor" href="#mysql-遇到的死锁问题" aria-hidden="true">#</a> MySQL 遇到的死锁问题</h1>
<p>产生死锁的四个必要条件：</p>
<ul>
<li>互斥条件：一个资源每次只能被一个进程使用。</li>
<li>请求与保持条件：一个进程因请求资源而阻塞时，对已获得的资源保持不放。</li>
<li>不剥夺条件：进程已获得的资源，在末使用完之前，不能强行剥夺。</li>
<li>循环等待条件：若干进程之间形成一种头尾相接的循环等待资源关系。</li>
</ul>
<p>这四个条件是死锁的必要条件，只要系统发生死锁，这些条件必然成立，而只要上述条件之一不满足，就不会发生死锁。 下列方法有助于最大限度地降低死锁：</p>
<ul>
<li>按同一顺序访问对象。</li>
<li>避免事务中的用户交互。</li>
<li>保持事务简短并在一个批处理中。</li>
<li>使用低隔离级别。</li>
<li>使用绑定连接。</li>
</ul>
</template>
